"App Management" = "App Verwaltung";

"WIFI Share" = "WiFi Dateitransfer";

"BT Download Only in Wi-Fi" = "BT Download nur in Wi-Fi";

"BT Bandwidth & Connection" = "BT Bandbreite & Verbindung";

"Maximum Connections" = "Maximale Verbindungen";

"Connections Per Torrent" = "Verbindungen per Torrent";

"Enable Limit" = "Aktiviere Limit";

"Upload Limit" = "Upload Limit";

"Download Limit" = "Download Limit";


"Automatically Install" = "Automatische Installation";

"Delete After Install" = "Löschen nach Installation";

"Remove Metadata"="Entferne Metadata";

"Keep Awake"="Wachzustand";

"This will keep your screen always ON while using AppCake"="Diese Funktion versetzt dein Gerät in den Wachzustand um Appcake offen zu halten";

"Remove Metadata will stop App Store from updating the app"="Entferne die Metadata-Datei nach der Installation, damit der Appstore dir keine Updates von den gecrackten Apps anzeigt";

"Enable iTunes Sync to make apps installed by AppCake can be transfered to your computer by iTunes."="Aktiviere iTunes Sync, damit Du die Apps, die von Appcake auf dein Gerät installiert worden sind, mit iTunes auf deinen Computer übertragen kannst.";

"iTunes Sync"="iTunes Sync";

"Feedback"="Feedback";

"Changelog"="Änderungsprotokoll";

"I Can Translate"="Ich kann übersetzen";

"Clear Image Cache"="Bildercache löschen";

"Settings" = "Einstellungen";

"Show iPhone Apps" = "Zeige iPhone Apps";